// Напишите программу, которая принимает на вход цифру, 
// обозначающую день недели, и проверяет, является ли этот день выходным
Console.Write("Input number of the day between 1 and 7: ");
int n = Convert.ToInt32(Console.ReadLine());
    if (n == 1)
    Console.WriteLine("no");
    if (n == 2) 
    Console.WriteLine("no");
    if (n == 3)
    Console.WriteLine("no");
    if (n == 4)
    Console.WriteLine("no");
    if (n == 5)
    Console.WriteLine("no");
    if (n == 6)
    Console.WriteLine("yes");
    if (n == 7)
    Console.WriteLine("yes");
