//Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
int GenerateRandomNumbers()
{
    int n = new Random().Next(100, 1000);
    return n;
}
int n = n % 100;
Console.Writeline(a);
